; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_1 ?v2 - type_2 ?v6 - type_3)
 	      (pred_3 ?v4 - object ?v6 - type_3)
	      (pred_2 ?v2 - type_2 ?v5 - type_1)
	      (pred_4 ?v2 - type_2 ?v4 - object ?v5 - type_1))

   (:action op_3
       :parameters  (?v2 - type_2 ?v3 ?v7 - type_3)
       :precondition (and  (pred_1 ?v2 ?v3))
       :effect (and  (pred_1 ?v2 ?v7)
		     (not (pred_1 ?v2 ?v3))))

   (:action op_2
       :parameters (?v2 - type_2 ?v8 - object ?v1 - type_3 ?v5 - type_1)
       :precondition  (and  (pred_3 ?v8 ?v1) (pred_1 ?v2 ?v1) (pred_2 ?v2 ?v5))
       :effect (and (pred_4 ?v2 ?v8 ?v5)
		    (not (pred_3 ?v8 ?v1)) 
		    (not (pred_2 ?v2 ?v5))))

   (:action op_1
       :parameters (?v2 - type_2 ?v8 - object ?v1 - type_3 ?v5 - type_1)
       :precondition  (and  (pred_4 ?v2 ?v8 ?v5) (pred_1 ?v2 ?v1))
       :effect (and (pred_3 ?v8 ?v1)
		    (pred_2 ?v2 ?v5)
		    (not (pred_4 ?v2 ?v8 ?v5)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_08 obj_09 - type_2
obj_06 obj_04 obj_10 obj_03 - type_1
obj_02 obj_11 obj_01 - type_3
obj_05 obj_12 obj_07 - object)
(:init
(pred_1 obj_08 obj_01)
(pred_2 obj_08 obj_06)
(pred_2 obj_08 obj_04)
(pred_1 obj_09 obj_02)
(pred_2 obj_09 obj_10)
(pred_2 obj_09 obj_03)
(pred_3 obj_05 obj_11)
(pred_3 obj_12 obj_02)
(pred_3 obj_07 obj_02)
)
(:goal
(and
(pred_3 obj_05 obj_02)
(pred_3 obj_12 obj_02)
(pred_3 obj_07 obj_01)
)
)

(:constraints
  (always (not (pred_1 obj_08 obj_11)))
)
)

; plan
1. (op_3 obj_08 obj_01 obj_02)
   deleted: (pred_1 obj_08 obj_01)
   added: (pred_1 obj_08 obj_02)
   goals met: 1 of 3
2. (op_2 obj_09 obj_07 obj_02 obj_03)
   deleted: (pred_3 obj_07 obj_02) (pred_2 obj_09 obj_03)
   added: (pred_4 obj_09 obj_07 obj_03)
   goals met: 1 of 3
3. (op_3 obj_09 obj_02 obj_01)
   deleted: (pred_1 obj_09 obj_02)
   added: (pred_1 obj_09 obj_01)
   goals met: 1 of 3
4. (op_1 obj_09 obj_07 obj_01 obj_03)
   deleted: (pred_4 obj_09 obj_07 obj_03)
   added: (pred_3 obj_07 obj_01) (pred_2 obj_09 obj_03)
   goals met: 2 of 3
5. (op_3 obj_09 obj_01 obj_11)
   deleted: (pred_1 obj_09 obj_01)
   added: (pred_1 obj_09 obj_11)
   goals met: 2 of 3
6. (op_2 obj_09 obj_05 obj_11 obj_03)
   deleted: (pred_3 obj_05 obj_11) (pred_2 obj_09 obj_03)
   added: (pred_4 obj_09 obj_05 obj_03)
   goals met: 2 of 3
7. (op_3 obj_09 obj_11 obj_02)
   deleted: (pred_1 obj_09 obj_11)
   added: (pred_1 obj_09 obj_02)
   goals met: 2 of 3
8. (op_1 obj_09 obj_05 obj_02 obj_03)
   deleted: (pred_4 obj_09 obj_05 obj_03)
   added: (pred_3 obj_05 obj_02) (pred_2 obj_09 obj_03)
   goals met: 3 of 3
